package homework_12;

public class Runner {
	public static void main(String[] args) {
//	1
//		--------------------------------------------
//		| JDK                                      |
//		|                                          |
//		|  javac                                   |
//		|  --------------------------------------  |
//		|  | JRE                                |  |
//		|  |                                    |  |
//		|  |  java                              |  |
//		|  |  --------------------------------  |  |
//		|  |  | JVM                          |  |  |
//		|  |  --------------------------------  |  |
//		|  --------------------------------------  |
//		--------------------------------------------
		
//	2
//		Чтобы просто поиграть, тебе нужен готовый плеер, который умеет открывать файлы игры. Чтобы написать игру, тебе нужен целый завод с инструментами, чтобы этот файл вообще собрать. Сама же игра в обоих случаях переводится, который объясняет команды компьютеру.
		
		
//	3
//		java version "25.0.1" 2025-10-21 LTS
//		Java(TM) SE Runtime Environment (build 25.0.1+8-LTS-27)
//		Java HotSpot(TM) 64-Bit Server VM (build 25.0.1+8-LTS-27, mixed mode, sharing)
//		javac 25.0.1
		
	}
}
