package homework_11;

public class Runner {
	public static void main(String[] args) {
	///1
		
		
//		System.out.println("Paris,Ankara,Baku,New York");
		
		
	///2
		
		
		System.out.print("Я изучаю Java");
		System.out.println("Я изучаю Java");
		System.out.printf("Я изучаю Java");
		
	///3
	    
		
		//Язык программирования — это своего рода свод правил и слов, с помощью которых человек объясняет компьютеру или телефону, что именно нужно сделать. В отличии от других языков программирвания Java больше всего используется в больших проектах.
		
	
	///4
	
		
		//Что получается - Байт-код. Кто запускает - JVM. JVM - переводчик.
		
	
	///5
	
		//Android - Большая часть мобильных приложений написана на Java
		//Netflix - Java используется на стороне сервера
		//Banks - Платёжная система.
		
	
	///7
	
	
	//История создания и этапы развития Java,Основные характеристики и преимущества Java,Платформы Java Java SE Jakarta EE Java ME
		//Мне кажется 3-ая тема более сложнее из-за её названия.
	}
}
